[
  {
    "content": "<p>Hello My Name is <a class=\"int-link\" href=\"/madmapper/6/the-history-of-video-mapping/about/1-and-beyond/the-end\" data-page-suid=\"gwHOZFmpAU\">FRZ</a></p>\n<p>Hello My Name is <a class=\"int-link\" href=\"/madmapper/6/the-history-of-video-mapping/about\" data-page-suid=\"YxaRDWwB4v\">BOBO</a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><img src=\"https://download.madmapper.com/madshop_prod/piment.png\" width=\"139\" height=\"139\" data-media-id=\"DQTDpNkeFI\"></p>\n<p>&nbsp;</p>\n<p>hellowww</p>\n<p>&nbsp;</p>\n<p>abcdefghijklmnopqrstuvwxyz</p>\n<p>0123456789</p>"
  },
  {
    "pageSuid": "YxaRDWwB4v",
    "pageSlug": "about",
    "lang": "en",
    "content": "<p>abababba</p>\n<p>&nbsp;</p>\n<p>jybfiynfgiukygb</p>\n<p>abababba</p>\n<p>abababba</p>\n<p>abababba</p>\n<p>abababba</p>\n<p>&nbsp;</p>\n<p>abababba</p>\n<p>abababba</p>\n<p>abababba</p>\n<p>abababba</p>\n<p>&nbsp;</p>\n<p>abababba</p>\n<p>abababba</p>\n<p>abababba</p>\n<p>abababba</p>\n<p>&nbsp;</p>"
  },
  {
    "pageSuid": "4A19MAyN4y",
    "pageSlug": "not-problematic-page",
    "lang": "en",
    "content": "<h2 id=\"whatisvideomapping\">What is Video Mapping?</h2>\n<p>Video mapping, also known as projection mapping, is a powerful technique that transforms any surface into a dynamic visual display. Unlike traditional flat-screen projections, video mapping allows you to project imagery onto three-dimensional objects, buildings, or irregular surfaces, creating immersive visual experiences that seem to bring static objects to life.</p>\n<h2 id=\"understandingthebasics\">Understanding the Basics</h2>\n<h3 id=\"coreconcepts\">Core Concepts</h3>\n<p>Video mapping works by <strong>precisely calibrating</strong> the projection to match the geometry of your target surface. This process involves:</p>\n<ul>\n<li><strong>Surface analysis</strong>: Understanding the shape, dimensions, and characteristics of your projection surface</li>\n<li><strong>Content creation</strong>: Designing visuals that complement and enhance the surface geometry</li>\n<li><strong>Mapping process</strong>: Aligning your digital content with the physical surface using specialized software</li>\n<li><strong>Output calibration</strong>: Fine-tuning brightness, color, and positioning for optimal results</li>\n</ul>\n<h3 id=\"typesofsurfaces\">Types of Surfaces</h3>\n<p>You can map onto virtually any surface:</p>\n<ul>\n<li><strong>Architectural elements</strong>: Buildings, walls, columns, and facades</li>\n<li><strong>Objects</strong>: Sculptures, vehicles, furniture, or custom-built structures</li>\n<li><strong>Natural formations</strong>: Trees, rocks, or landscape features</li>\n<li><strong>Fabric and textiles</strong>: Screens, curtains, or draped materials</li>\n</ul>\n<h2 id=\"planningyourvideomappingproject\">Planning Your Video Mapping Project</h2>\n<h3 id=\"preproductionconsiderations\">Pre-Production Considerations</h3>\n<p>Before diving into MadMapper, consider these essential planning steps:</p>\n<ol>\n<li><strong>Site survey</strong>: Visit your projection location and document the space</li>\n<li><strong>Surface measurement</strong>: Record precise dimensions and angles</li>\n<li><strong>Environmental factors</strong>: Assess ambient light, weather conditions, and accessibility</li>\n<li><strong>Technical requirements</strong>: Determine projector specifications and power needs</li>\n<li><strong>Content strategy</strong>: Plan your visual narrative and artistic goals</li>\n</ol>\n<h3 id=\"equipmentessentials\">Equipment Essentials</h3>\n<p>For successful video mapping, you'll need:</p>\n<ul>\n<li><strong>Projectors</strong>: Choose based on brightness, resolution, and throw distance</li>\n<li><strong>Computer</strong>: Ensure sufficient processing power for real-time rendering</li>\n<li><strong>Cables and adapters</strong>: Plan for proper connectivity between devices</li>\n<li><strong>Mounting hardware</strong>: Secure positioning for projectors and equipment</li>\n</ul>\n<h2 id=\"contentcreationworkflow\">Content Creation Workflow</h2>\n<h3 id=\"designingfordimension\">Designing for Dimension</h3>\n<p>Creating effective video mapping content requires a different approach than traditional video production:</p>\n<ul>\n<li><strong>Think in layers</strong>: Design elements that can work independently and together</li>\n<li><strong>Consider perspective</strong>: How will your content look from different viewing angles?</li>\n<li><strong>Use depth wisely</strong>: Leverage the three-dimensional nature of your surface</li>\n<li><strong>Plan for interaction</strong>: Consider how light and shadow will affect your projection</li>\n</ul>\n<h3 id=\"technicalspecifications\">Technical Specifications</h3>\n<p>When creating content for video mapping:</p>\n<ol>\n<li><strong>Resolution matching</strong>: Ensure your content resolution matches your projector output</li>\n<li><strong>Frame rate consistency</strong>: Maintain smooth playback with appropriate frame rates</li>\n<li><strong>Color management</strong>: Account for surface color and texture in your designs</li>\n<li><strong>File organization</strong>: Structure your project files for easy management in MadMapper</li>\n</ol>\n<h2 id=\"settingupyourmappingsession\">Setting Up Your Mapping Session</h2>\n<h3 id=\"initialsetup\">Initial Setup</h3>\n<p>Begin your mapping session with these fundamental steps:</p>\n<ul>\n<li><strong>Projector positioning</strong>: Place projectors for optimal coverage and minimal distortion</li>\n<li><strong>Surface preparation</strong>: Clean and prepare your projection surface</li>\n<li><strong>Lighting control</strong>: Minimize ambient light for maximum contrast</li>\n<li><strong>Safety measures</strong>: Ensure all equipment is securely mounted and cables are managed</li>\n</ul>\n<h3 id=\"calibrationprocess\">Calibration Process</h3>\n<p>The mapping process involves several calibration stages:</p>\n<ol>\n<li><strong>Geometric correction</strong>: Align your projection with surface boundaries</li>\n<li><strong>Perspective adjustment</strong>: Correct for projector angle and distance</li>\n<li><strong>Color balance</strong>: Adjust for surface color and ambient conditions</li>\n<li><strong>Brightness optimization</strong>: Ensure even illumination across the surface</li>\n</ol>\n<h2 id=\"advancedtechniques\">Advanced Techniques</h2>\n<h3 id=\"multiprojectorsetups\">Multi-Projector Setups</h3>\n<p>For larger surfaces or higher resolution requirements:</p>\n<ul>\n<li><strong>Edge blending</strong>: Seamlessly combine multiple projector outputs</li>\n<li><strong>Brightness matching</strong>: Balance output levels across all projectors</li>\n<li><strong>Color synchronization</strong>: Ensure consistent color reproduction</li>\n<li><strong>Content distribution</strong>: Manage how content spans across multiple outputs</li>\n</ul>\n<h3 id=\"interactiveelements\">Interactive Elements</h3>\n<p>Enhance your video mapping with interactive features:</p>\n<ul>\n<li><strong>Motion sensors</strong>: Trigger content changes based on audience movement</li>\n<li><strong>Audio reactive</strong>: Sync visuals with music or environmental sounds</li>\n<li><strong>Remote control</strong>: Enable real-time adjustments during performances</li>\n<li><strong>Scheduled playback</strong>: Automate content changes based on time or events</li>\n</ul>\n<h2 id=\"troubleshootingcommonissues\">Troubleshooting Common Issues</h2>\n<h3 id=\"visualproblems\">Visual Problems</h3>\n<p>When your mapping doesn't look right:</p>\n<ul>\n<li><strong>Alignment issues</strong>: Revisit your surface measurements and calibration points</li>\n<li><strong>Color distortion</strong>: Check projector settings and surface characteristics</li>\n<li><strong>Brightness variations</strong>: Adjust projector positioning or add additional units</li>\n<li><strong>Content scaling</strong>: Verify your source material resolution and aspect ratio</li>\n</ul>\n<h3 id=\"technicaldifficulties\">Technical Difficulties</h3>\n<p>Common technical challenges and solutions:</p>\n<ul>\n<li><strong>Performance lag</strong>: Optimize content resolution and computer specifications</li>\n<li><strong>Connection problems</strong>: Verify all cables and adapter compatibility</li>\n<li><strong>Software crashes</strong>: Ensure system stability and regular project saves</li>\n<li><strong>Hardware failures</strong>: Maintain backup equipment and quick replacement procedures</li>\n</ul>\n<p>Video mapping opens up endless creative possibilities, transforming ordinary spaces into extraordinary visual experiences. With proper planning, technical understanding, and creative vision, you can create memorable installations that captivate and inspire audiences.</p>"
  },
  {
    "pageSuid": "EGea2fMGis",
    "pageSlug": "the-early-days",
    "lang": "en",
    "content": "<p>It all began in the Grotte de Lascaux</p>"
  },
  {
    "pageSuid": "K4zC0vQRsG",
    "pageSlug": "problematic-page",
    "lang": "en",
    "content": "<p>dfvbfv</p>"
  },
  {
    "pageSuid": "0aAXfsfuIA",
    "pageSlug": "historicsal-concept",
    "lang": "en",
    "content": "<h2 id=\"thedawnofprojectionfromcavewallstomovingimages\">The Dawn of Projection: From Cave Walls to Moving Images</h2>\n<h3 id=\"ancientbeginningslightandshadow\">Ancient Beginnings: Light and Shadow</h3>\n<p>The story of video mapping begins in the darkness of prehistoric caves. Our ancestors discovered that <strong>fire could cast shadows on cave walls</strong>, creating the first immersive visual experiences. These early humans painted on uneven rock surfaces, understanding intuitively how light and surface texture could enhance storytelling.</p>\n<p>The ancient Greeks later developed the <strong>camera obscura</strong>, a dark chamber where light passing through a small hole projected images of the outside world onto walls. This principle laid the groundwork for all future projection technologies.</p>\n<h3 id=\"themagiclanternera\">The Magic Lantern Era</h3>\n<p>In the 17th century, inventors created the <strong>magic lantern</strong> - essentially the first slide projector. This device used:</p>\n<ul>\n<li>Oil lamps or candles as light sources</li>\n<li>Hand-painted glass slides</li>\n<li>Simple lens systems to focus images</li>\n</ul>\n<p>Magic lanterns became popular entertainment, projecting stories and educational content onto walls and screens in public halls and homes.</p>\n<h3 id=\"photographymeetsprojection\">Photography Meets Projection</h3>\n<p>The 19th century brought revolutionary changes with the invention of photography. Suddenly, <strong>realistic images could be captured and projected</strong>. The development of:</p>\n<ul>\n<li><strong>Photographic slides</strong> replaced hand-painted glass</li>\n<li><strong>Improved lighting systems</strong> using gas and later electricity</li>\n<li><strong>Better lens technology</strong> for sharper, brighter images</li>\n</ul>\n<p>These advances made projection more practical and widespread.</p>\n<h3 id=\"cinemasbirth\">Cinema's Birth</h3>\n<p>The late 1800s saw the convergence of projection and motion. Inventors like the <strong>Lumi&egrave;re Brothers</strong> combined rapid sequential photography with projection systems, creating the first movies. Their cinematograph could both record and project moving images, establishing the foundation of cinema.</p>\n<h3 id=\"thefirstvideoprojectors\">The First Video Projectors</h3>\n<p>The transition from film to electronic projection began in the mid-20th century. Early video projectors evolved from:</p>\n<ul>\n<li><strong>Television technology</strong> of the 1940s-50s</li>\n<li><strong>Cathode ray tube (CRT) systems</strong> that could project TV signals</li>\n<li><strong>Three-tube RGB projectors</strong> of the 1970s for better color reproduction</li>\n</ul>\n<p>These early video projectors were <strong>large, expensive, and primarily used in professional settings</strong> like planetariums and large auditoriums. They marked the beginning of what would eventually become modern video mapping - the ability to project dynamic, electronic content onto any surface.</p>\n<p>This technological evolution set the stage for today's sophisticated mapping systems, where any surface can become a canvas for digital storytelling.</p>"
  },
  {
    "pageSuid": "zhOoeZDMnI",
    "pageSlug": "the-day-before-it-happenned",
    "lang": "en",
    "content": "<h2>BALBLALALA</h2>\n<p>1233456</p>\n<h2 id=\"thebigbangandcosmicexpansion\">The Big Bang and Cosmic Expansion</h2>\n<p>alors le big bang ce n'est pas s&ucirc;r</p>\n<p>The <strong>Big Bang theory</strong> represents our current best understanding of how the universe began and evolved into what we observe today. According to this model, the universe started from an extremely hot, dense state approximately <strong>13.8 billion years ago</strong>.</p>\n<h3 id=\"theinitialsingularity\">The Initial Singularity</h3>\n<p>At the very beginning, all matter and energy in the universe was compressed into a point of infinite density called a <strong>singularity</strong>. At this moment, the fundamental forces of physics as we know them did not yet exist, and our current understanding of space and time breaks down.</p>\n<h3 id=\"thefirstmomentsofexpansion\">The First Moments of Expansion</h3>\n<p>Rather than an explosion <em>into</em> space, the Big Bang was an expansion <em>of</em> space itself. In the first fraction of a second:</p>\n<ul>\n<li>The universe underwent <strong>rapid inflation</strong>, expanding faster than the speed of light</li>\n<li>Temperatures were incredibly high, preventing the formation of atoms</li>\n<li>Only fundamental particles and energy existed in this primordial soup</li>\n</ul>\n<h3 id=\"coolingandstructureformation\">Cooling and Structure Formation</h3>\n<p>As the universe continued to expand, it began to cool:</p>\n<ul>\n<li><strong>Protons and neutrons</strong> formed from quarks</li>\n<li>Light elements like <strong>hydrogen and helium</strong> were created through nucleosynthesis</li>\n<li>After about 380,000 years, the universe cooled enough for electrons to combine with nuclei, forming the first atoms</li>\n<li>This allowed light to travel freely for the first time, creating what we now observe as the <strong>cosmic microwave background radiation</strong></li>\n</ul>\n<h3 id=\"evidenceforexpansion\">Evidence for Expansion</h3>\n<p>The expansion theory is supported by several key observations:</p>\n<ul>\n<li><strong>Hubble's Law</strong>: Distant galaxies are moving away from us, with more distant galaxies receding faster</li>\n<li><strong>Cosmic microwave background</strong>: The afterglow of the Big Bang fills the entire universe</li>\n<li><strong>Abundance of light elements</strong>: The observed ratios of hydrogen and helium match theoretical predictions</li>\n</ul>\n<p>This expansion continues today, with the universe growing larger and cooler as time progresses.</p>"
  },
  {
    "pageSuid": "cKuSVasvuN",
    "pageSlug": "1-and-beyond",
    "lang": "en",
    "content": "<p>After they invented the video projector</p>\n<p>test</p>\n<p>un truc</p>"
  },
  {
    "pageSuid": "gwHOZFmpAU",
    "pageSlug": "the-end",
    "lang": "en",
    "content": "<p>My only friend</p>"
  },
  {
    "pageSuid": "b0iVTYJnoe",
    "pageSlug": "about-madmapper",
    "lang": "en",
    "content": "<h2 class=\"int-link-anchors\">About MadMapper</h2>\n<p>MadMapper is a collaborative software project between the french installation studio 1024 architecture and the Swiss software makers GarageCube. With more than 10 years experience in the field, we are devoted to bringing you the best tool for your artistic needs.</p>\n<p>&nbsp;</p>\n<p>More photos to come below.</p>"
  },
  {
    "pageSuid": "r0NrKs4C9N",
    "pageSlug": "madai",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "w3JeqA9XUa",
    "pageSlug": "getting-started",
    "lang": "en",
    "content": "<h2 class=\"int-link-anchors\">About MadAI</h2>\n<h3>Extra Intelligence at your fingertips !</h3>\n<p>MadAI uses artificial intelligence to help you develop realtime materials and FX for MadMapper.</p>\n<p>Let your imagination go wild !</p>\n<p>&nbsp;</p>\n<p><img src=\"https://download.madmapper.com/madshop_prod/7C3C6A98-D1A3-434D-B46F-A6B075411841.png\" width=\"638\" height=\"425\" data-media-id=\"Jp8RPeE9UG\"></p>\n<h3>What you can do</h3>\n<p>MadAI allows you to:</p>\n<ul>\n<li>Generate brand-new shaders</li>\n<li>Remix existing materials</li>\n<li>Create laser materials</li>\n<li>Build and edit 2DFX surfaces</li>\n<li>Publish your creations to the online Library</li>\n</ul>\n<h3>Coding skills</h3>\n<p>MadAI is designed for everyone, including non-coders. If you're just getting started, you can generate stunning results using simple prompts - no technical knowledge required.</p>\n<h3>Iterative prompts</h3>\n<p>Iterative prompting means building your creation step by step using short, focused prompts.</p>\n<p>Here are a few helpful examples:</p>\n<ul>\n<li>&ldquo;Create a sphere in 3D with lighting&rdquo;</li>\n<li>&ldquo;Add camera angle controls&rdquo;</li>\n<li>&ldquo;Add depth fog\"</li>\n</ul>\n<div id=\"products\"></div>"
  },
  {
    "pageSuid": "320vdCTyXG",
    "pageSlug": "credits",
    "lang": "en",
    "content": "<h2 class=\"int-link-anchors\">Credits</h2>\n<h3>Basics</h3>\n<p>MadAI credits are required to make requests to MadAI Artificial Intelligence. You can purchase credits here: <a title=\"MadAI Credits\" href=\"https://madmapper.com/extensions/madai\" target=\"_blank\" rel=\"noopener\">https://madmapper.com/extensions/madai</a></p>\n<p>The credits will be stored in your MadMapper account. Basically 1 credit = 1 prompt.</p>\n<h4>Expiration</h4>\n<p>Unused credits remain in your account until you use them. They don&rsquo;t expire!</p>\n<h4>Prompts</h4>\n<p>Basically 1 credit = 1 prompt. The quality level or style you choose does not affect credit usage. Even at maximum settings, 1 credit always equals 1 prompt.</p>\n<h3>Troubleshooting</h3>\n<h4>I&rsquo;ve purchased credits but they don&rsquo;t appear in MadMapper</h4>\n<ul>\n<li>Check your email for the order confirmation</li>\n<li>Log in to your MadMapper account to verify that the order has been placed and successfully paid</li>\n<li>In MadMapper, go to Account (top menu) and make sure you're logged into the correct account</li>\n<li>Try logging out and logging back in</li>\n</ul>\n<p>If the issue persists, please contact the support with your order number and MadMapper account ID.</p>\n<h4>I submitted a prompt but received an error message</h4>\n<ul>\n<li>Please share the exact error message with our support team</li>\n<li>Also make sure you&rsquo;re using the latest version of MadMapper available under your license</li>\n</ul>"
  },
  {
    "pageSuid": "Vpyz73pef5",
    "pageSlug": "video-tutorials",
    "lang": "en",
    "content": "<h2 class=\"int-link-anchors\">Youtube video tutorials</h2>\n<h3>Discover MadAI</h3>\n<p><iframe src=\"https://www.youtube.com/embed/nA_oM8N7Mxw?embeds_referring_euri=https\" width=\"560\" height=\"314\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>&nbsp;</p>\n<h3>Audio reactive materials using MadAI</h3>\n<p><iframe src=\"https://www.youtube.com/embed/ZM7ExAPOEf4\" width=\"560\" height=\"314\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>&nbsp;</p>\n<h3>Remix materials with AI in MadMapper</h3>\n<p><iframe src=\"https://www.youtube.com/embed/qKd6o-ttl2g\" width=\"560\" height=\"314\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<h3><br>MadAI creates 2D surface FX</h3>\n<p><iframe src=\"https://www.youtube.com/embed/juLnN9MOFfg\" width=\"560\" height=\"314\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>&nbsp;</p>\n<h3>Use AI to generate a Laser Material</h3>\n<p><iframe src=\"https://www.youtube.com/embed/KTkepMgTTGU\" width=\"560\" height=\"314\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>&nbsp;</p>\n<h3>Use Mad AI to generate a city !</h3>\n<p><iframe src=\"https://www.youtube.com/embed/1-Kom9MUt68\" width=\"560\" height=\"314\" allowfullscreen=\"allowfullscreen\"></iframe></p>"
  },
  {
    "pageSuid": "PRw6mbHC73",
    "pageSlug": "cheat-sheet",
    "lang": "en",
    "content": "<h2 class=\"int-link-anchors\">MadAI cheat sheet</h2>\n<h3>Prompting best practices</h3>\n<h4>Basic shapes</h4>\n<p class=\"p1\">sphere</p>\n<p class=\"p1\">cube</p>\n<p class=\"p1\">pyramid</p>\n<p class=\"p1\">platonic solid</p>\n<p class=\"p1\">torus</p>\n<p class=\"p1\">cylinder</p>\n<p class=\"p1\">plane</p>\n<h4>Rendering</h4>\n<p class=\"p1\">3d</p>\n<p class=\"p1\">raymarching</p>\n<p class=\"p1\">sdf</p>\n<p class=\"p1\">ambient occlusion</p>\n<p class=\"p1\">lighting</p>\n<p class=\"p1\">shading</p>\n<p class=\"p1\">specular</p>\n<p class=\"p1\">diﬀuse lighting</p>\n<p class=\"p1\">soft shadow</p>\n<p class=\"p1\">hard shadow</p>\n<p class=\"p1\">fresnel</p>\n<p class=\"p1\">bloom</p>\n<p class=\"p1\">glow</p>\n<p class=\"p1\">outline</p>\n<p class=\"p1\">curvature</p>\n<p class=\"p1\">normal displacement</p>\n<p class=\"p1\">deformation</p>\n<p class=\"p1\">greeble</p>\n<p class=\"p1\">outline</p>\n<p class=\"p1\">repeat in X Y Z axis</p>\n<p class=\"p1\">pMod</p>\n<p class=\"p1\">depth fog</p>\n<h4>Noises</h4>\n<p class=\"p1\">fBm</p>\n<p class=\"p1\">vnoise</p>\n<p class=\"p1\">voronoi</p>\n<p class=\"p1\">flowNoise</p>\n<h4>Camera</h4>\n<p class=\"p1\">camera angle</p>\n<p class=\"p1\">camera orbit</p>\n<p class=\"p1\">FOV</p>\n<h4>Animation</h4>\n<p class=\"p1\">breathe</p>\n<p class=\"p1\">wobble</p>\n<p class=\"p1\">flicker</p>\n<p class=\"p1\">bounce</p>\n<p class=\"p1\">rotozoom</p>\n<p class=\"p1\">sine warp</p>"
  },
  {
    "pageSuid": "qttFw8vcap",
    "pageSlug": "troubleshooting",
    "lang": "en",
    "content": "<h2 class=\"int-link-anchors\">Troubleshooting</h2>\n<h4>I can&rsquo;t find MadAI in MadMapper</h4>\n<p>Make sure you are using MadMapper version 5.7 or later, and you are logged into MadMapper with the correct account.</p>\n<p>To access MadAI:</p>\n<ul>\n<li>In MadMapper, go to the bottom panel</li>\n<li>Open the Tools section</li>\n<li>Find AI / Code Editor in the list</li>\n<li>Click the + (plus) button &rarr; Select New Material</li>\n<li>Make sure \"Using MadAI\" is checked</li>\n</ul>\n<p>If the option is still missing, try restarting MadMapper or reinstalling the latest version supported by your license.</p>\n<h4>MadMapper says the material name is already in use, but I&rsquo;ve deleted it</h4>\n<p>This is a known behavior. Simply choose a different material name, even if the previous one was deleted. The name may still be cached.</p>\n<h4>I can&rsquo;t connect to the MadMapper Library</h4>\n<p>Please check the following:</p>\n<ul>\n<li>Are you connected to the internet?</li>\n<li>Are you using the correct password for your account?</li>\n<li>Do you have any firewalls or security software that could be blocking access? Try temporarily disabling them or whitelisting MadMapper</li>\n</ul>\n<h4>I&rsquo;ve purchased credits but they don&rsquo;t appear in MadMapper</h4>\n<ul>\n<li>Check your email for the order confirmation</li>\n<li>Log in to your MadMapper account to verify that the order has been placed and successfully paid</li>\n<li>In MadMapper, go to Account (top menu) and make sure you're logged into the correct account</li>\n<li>Try logging out and logging back in</li>\n</ul>\n<p>If the issue persists, please contact the support with your order number and MadMapper account ID.</p>\n<h4>I submitted a prompt but received an error message</h4>\n<ul>\n<li>Please share the exact error message with our support team</li>\n<li>Also make sure you&rsquo;re using the latest version of MadMapper available under your license</li>\n</ul>\n<h4>I can&rsquo;t post my material to the library</h4>\n<ul>\n<li>Make sure you&rsquo;re connected to the Library in MadMapper</li>\n<li>Double-check that you are using the correct account</li>\n<li>Restart MadMapper and check for updates</li>\n</ul>\n<p>If the issue persists, please contact the support team</p>\n<h4>MadMapper is crashing</h4>\n<ul>\n<li>Make sure you&rsquo;re using the latest version available for your license</li>\n<li>If the crash persists, please send the crash report (which appears after reopening the app) to our support team</li>\n</ul>"
  },
  {
    "pageSuid": "u3IVMwF3Rz",
    "pageSlug": "ai-users-projects",
    "lang": "en",
    "content": "<h2 class=\"int-link-anchors\">AI users wonders</h2>\n<p><img src=\"https://download.madmapper.com/madshop_prod/Playmodes Beyond.jpg\" width=\"794\" height=\"447\" data-media-id=\"NNN93ZVPaC\"></p>\n<h4>Playmodes / Beyond - 2025</h4>\n<p>More to come...</p>"
  },
  {
    "pageSuid": "FemLlzHh3B",
    "pageSlug": "madai-stars",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "UeMk7FMfxY",
    "pageSlug": "the-history-of-video-mapping",
    "lang": "en",
    "content": "<p>Hello My Name is <a class=\"int-link\" href=\"/madmapper/6undefined\" data-page-suid=\"gwHOZFmpAU\">FRZ</a></p>\n<p>Hello My Name is <a class=\"int-link\" href=\"/madmapper/6/the-history-of-video-mapping/about\" data-page-suid=\"YxaRDWwB4v\">BOBO</a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><img src=\"https://download.madmapper.com/madshop_prod/piment.png\" width=\"139\" height=\"139\" data-media-id=\"DQTDpNkeFI\"></p>\n<p>&nbsp;</p>\n<p>hellowww</p>\n<p>&nbsp;</p>\n<p>abcdefghijklmnopqrstuvwxyz</p>\n<p>0123456789</p>"
  },
  {
    "pageSuid": "RjJq1TKK4w",
    "pageSlug": "the-future",
    "lang": "en",
    "content": "<p>The future beautiful and bright</p>"
  },
  {
    "pageSuid": "7BQ514ZYg3",
    "pageSlug": "about-what",
    "lang": "en",
    "content": "<h2 class=\"int-link-anchors\">We need to know?</h2>"
  },
  {
    "pageSuid": "X8TJ9Q6WGQ",
    "pageSlug": "you-know",
    "lang": "en",
    "content": "<h4>Of course!</h4>"
  },
  {
    "pageSuid": "9cWOdAKBSn",
    "pageSlug": "the-origins-of-mapping",
    "lang": "en",
    "content": "<h2 class=\"int-link-anchors\">Origins...</h2>\n<p>When it started?</p>"
  },
  {
    "pageSuid": "aRZYkYar4M",
    "pageSlug": "madai-last-news",
    "lang": "en",
    "content": "<h2 class=\"int-link-anchors\">Last news</h2>"
  }
]